from gallery.models import ArtExhibition

source = "https://www.the-village.com.ua/village/culture/art/337923-15-vistavok-kvitnya-kontstabir-yagidne-kartini" \
         "-kiyivskogo-dvirnika-y-inozemni-poshtovi-marki"

art1 = ArtExhibition.objects.create(
    name="ФОРМИ ПРИСУТНОСТІ",
    place="Мистецький Арсенал",
    source=source,
    description="""
Рваний папір, вишивка на пакеті, дім із піску й скла, крихти землі, необроблене дерево позначають присутність війни й особистих досвідів художників, який вони пережили за рік. Хтось став військовим чи волонтером, хтось втратив свою майстерню, а хтось просто продовжував фіксувати нову реальність на полотні. Два десятки художників присутні на виставці не лише через свої роботи, але й через власні історії, які стали контекстом для створення мистецтва, кажуть куратори експозиції.
    """,
    address="вулиця Лаврська, 10-12")

art1.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/OD0COrLdtVppAonfUr9Gxw.jpg")

art2 = ArtExhibition.objects.create(
    name="ПІСЛЯ БЛЕКАУТУ",
    source=source,
    place="Dymchuk Gallery",
    description="""
З приходом весни починаєш усвідомлювати, що українці пережили цієї осені та взимку, коментує харківський художник Сергій Кондратюк, який живе в Києві. Вулиці міста нарешті почало заливати сонячне світло на противагу свічкам і ліхтарям. Митець створив серію пейзажів (зокрема пейзажів Подолу) про те, як виглядає місто без світла. Змінилися вулиці, але змінилися й самі люди, переконаний художник. На додачу до живопису він демонструє графіку та скульптуру, створену з жовтня 2022 року, коли росіяни почали регулярно атакувати енергетичну інфраструктуру України.
    """,
    address="вулиця Ярославська, 21")

art2.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/j89rZfh1lWx3hCnqsj2SvQ.jpg")

art3 = ArtExhibition.objects.create(
    name="ЗУСТРІЧ У БОМБОСХОВИЩІ",
    source=source,
    place="ЦСМ «Білий світ»",
    description="""
Одеські художники Сергій Божко та Ігор Гусєв чи то за легендою, чи насправді зустрілися в бомбосховищі під час вибухів іранських дронів. Божко побачив, як Гусєв розглядав порожні стіни – ідеальні для виставки картин в укритті, де й «відвідуваність хороша». Вони пожартували, що військкомат також був би місцем із «хорошою відвідуваністю», але ж коридори вузькі й світло погане. Тому митці вирішили зробити спільну виставку в київському ЦСМ «Білий світ».

Куратори виставки зауважують, що художники говорять про одне й те саме, але різними мовами. Тут можна знайти графічні щоденники Ігоря Гусєва і живопис Сергія Божка «про фундаментальні конфлікти руского міра з нормальним людським життям».
""",
    address="вулиця Чикаленка, 21-А (раніше – Пушкінська)")
art3.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/5Cjj7lJaCT4lTV1rZgXqug.jpg")

art4 = ArtExhibition.objects.create(
    name="КАМЕРА ОБСКУРА",
    place="Voloshyn Gallery",
    source=source,
    description="""
Галерея відновлює роботу в Києві й відразу представляє групову виставку. Серед учасників – Влада Ралко, Леся Хоменко, Нікіта Кадан, Брілант Мілазімі з Косово, болгарська художниця Кразиміра Бутцева й інші митці, які намагаються показати світло у тьмі, що охопила Україну, розповідають організатори експозиції.

З камери-обскури почалася історія фотографії: це світлонепроникний ящик, який, однак, через малий отвір проєктує перевернуте зображення предмета. У цьому випадку приміщення галереї – це чорна камера, а роботи митців – промені світла, які перетинаються та ведуть діалог між собою, виходячи за видиму лінію перспективи, коментують куратори виставки.
    """,
    address="вулиця Терещенківська, 13-А")

art4.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/gBwm_iDyB5HzYew54gzPIg.jpg")

art5 = ArtExhibition.objects.create(
    name="ВІД КОРІННЯ",
    place="YA Gallery",
    source=source,
    description="""
Для скульптора Володимира Семківа інструментом стає бензопила, а формою художнього вираження – дерево. Усі роботи створені у 2022–2023 роках, які митець характеризує як часи водночас надії та втрат, утоми й сили, випробувань і віри, страху й відваги, надзусиль і перемоги.
    """,
    address="вулиця Хорива, 49-Б")
art5.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/OrQ-Y5uqOsRIufefOMl_Ug.jpg")

art6 = ArtExhibition.objects.create(
    name="ПІД ПОВЕРХНЕЮ",
    place="Музей історії Києва",
    source=source,
    description="""
Моря не лише розділяють, але й об’єднують, переконані художниці й кураторки Лера Літвінова й Леонора Янко, які вирішили дослідити минуле, теперішнє й майбутнє України у своїх стосунках із Чорним та Азовським морями. «На поверхню» вони виносять і частину історії кримських татар. Звукові записи для виставки – це перетворені потоки даних із супутників спостереження Землі, досліджень біомаси та біорізноманіття, які створив шотландський композитор Майкл Бегг, відомий співпрацею з науковцями й дослідниками. Експозицію також озвучують вірші львівського поета Артура Дроня, який зараз служить у ЗСУ.

Також до 16 квітня в Музеї Києва триватиме спільна експозиція з Національним музеєм народної архітектури й побуту. Головний образ виставки – це птах у народному мистецтві, на рушниках, розписах і полотнах. На експозиції покажуть декоративно-ужиткові речі другої половини 19 століття, і деякі з них будуть експонувати вперше.
    """,
    address="вулиця Богдана Хмельницького, 7")
art6.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/1Vti6ooslNyqRGqb11yzzw.jpg")

art7 = ArtExhibition.objects.create(
    name="ПЕРЕДЧУТТЯ ЗМІН",
    place="Галерея Portal 11",
    source=source,
    description="""
Узяти ознаки предмета та «зігнути» їх між минулим і теперішнім намагається львівський художник Ігор Палій, який у своїй творчості апелює до силогізмів. Ідеться про дедуктивний умовивід, де з двох суджень одержують третє судження, зумовлене першими двома, пояснюють куратори виставки. Це не зовсім інтерпретація предмета та його ознак – скоріше роздуми та висновки, певна «кротова нора», що спотворює простір і час настільки, що може сполучити віддалені точки. Сам митець називає свій метод художньої трансформації «книжкою з історіями».

Крім того, 29 квітня в галереї стартує колективна виставка «Втрачене/ Знайдене». З-поміж 200 заявок відібрали роботи 16 митців, які експонуватимуть до 4 червня.
    """,
    address="вулиця Трьохсвятительська, 11")

art7.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/KQB7xhnQ6toDqdpSwHUXEQ.jpg")

art8 = ArtExhibition.objects.create(
    name="ВОЇНИ СВІТЛА",
    place="Київська картинна галерея",
    source=source,
    description="""
Виставку україно-американського художника Макса Вітика «Воїни світла» повернули до музею після ракетного удару 10 жовтня. Там представлять 12 великих полотен, створених між 2013 і 2015 роками: вони описують революційні події, які автор пережив під час перебування в Україні. Художник каже, що в процесі роботи думав про людей, яких бачив у Києві – «нерозважливо хоробрих, наївних і чистих, майже як діти».
    """,
    address="вулиця Терещенківська, 9")

art8.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/vUs-otYUT2XoblCumjrDqg.jpg")

art9 = ArtExhibition.objects.create(
    name="ПОГЛЯД ЗАБУТИХ ПРЕДКІВ",
    place="Національний музей Тараса Шевченка",
    source=source,
    description="""
Роботи у стилі кубізму від Сергія Серневича під псевдонімом VilVich мають на меті не лише показати світ емоцій митця, але й звернути увагу на проблеми ВІЛ-позитивних людей в українському суспільстві. Художник знайшов себе у творчості саме після того, як дізнався про свій ВІЛ-позитивний статус. Також він заснував фонд «Чисте серце», який допомагає ВІЛ-інфікованим і їхнім родинам.

До 21 квітня в музеї також можна буде побачити артінсталяцію Богоматері Оранти із «Софії Київської», яку виконали як колаж із семи тисяч фото українців.
    """,
    address="бульвар Шевченка, 12")

art9.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/SN5MmSKjZEu84GK8eQLI0g.jpg")

art10 = ArtExhibition.objects.create(
    name="НАСПІЛ",
    place="Imagine Point",
    source=source,
    description="""
Самоідентифікацію українців організатори експозиції Олександри Кришовської та Ira Africa називають «бігом із перешкодами, які встановлювала сама історія». 24 лютого стало тригером, через який увесь світ побачив силу українців, про яку ми, можливо, раніше й не здогадувалися. І це не лише про етнічних українців, але й про інші народи, які живуть на нашій землі, захищають її та усвідомлюють себе частиною України. Експозицію можна переглянути в малій залі галереї (вхід із двору).

Водночас у великій залі галереї триватиме виставка Василя Татарського й Максима Мазура «Часоформи. Новожиття». Митці, певно, шукали натхнення в авторських неологізмах Михайля Семенка. Вони не бояться «лабораторної експериментальності» й перетворюють грубі й утилітарні матеріали в нові абстрактні форми. Це метафори уламків, які виникли внаслідок руйнування світу – і тепер ці уламки потрібно зібрати та склеїти.
    """,
    address="проспект Голосіївський, 86/1")

art10.images.create(
    image_url="https://img.the-village.com.ua/the-village.com.ua/post_image-image/by0R2mG4LXSzB5luiATQEQ.jpg")
